chore: readme update - mermaid diagram
